/*
  Localizable.strings (Русский)
  ClipArc

  Created by Adam Lyu on 2026-01-22.
*/

// MARK: - Common
"app.name" = "ClipArc";
"common.enable" = "Включить";
"common.disable" = "Выключить";
"common.cancel" = "Отмена";
"common.done" = "Готово";
"common.save" = "Сохранить";
"common.delete" = "Удалить";
"common.copy" = "Копировать";
"common.paste" = "Вставить";
"common.search" = "Поиск";
"common.settings" = "Настройки";
"common.continue" = "Продолжить";
"common.skip" = "Пропустить";
"common.skip_for_now" = "Пропустить пока";
"common.edit" = "Изменить";
"common.select_all" = "Выбрать всё";

// MARK: - Language
"language.system" = "Системный по умолчанию";

// MARK: - Onboarding Welcome
"onboarding.welcome.title" = "Добро пожаловать в ClipArc";
"onboarding.welcome.subtitle" = "Ваш умный менеджер буфера обмена для macOS";
"onboarding.welcome.get_started" = "Начать";

// MARK: - Onboarding Features
"onboarding.feature.history.title" = "История буфера обмена";
"onboarding.feature.history.description" = "Доступ ко всему, что вы скопировали";
"onboarding.feature.search.title" = "Мгновенный поиск";
"onboarding.feature.search.description" = "Найдите любой клип за секунды";
"onboarding.feature.hotkey.title" = "Глобальная горячая клавиша";
"onboarding.feature.hotkey.description" = "⇧⌘V из любого места";

// MARK: - Onboarding Permissions
"onboarding.permissions.title" = "Разрешения";
"onboarding.permissions.subtitle" = "ClipArc нужны некоторые разрешения для правильной работы";
"onboarding.permissions.accessibility.title" = "Универсальный доступ";
"onboarding.permissions.accessibility.description" = "Требуется для автовставки";
"onboarding.permissions.launch_at_login.title" = "Запуск при входе";
"onboarding.permissions.launch_at_login.description" = "Автоматический запуск ClipArc";

// MARK: - Onboarding Sign In
"onboarding.signin.title" = "Вход";
"onboarding.signin.subtitle" = "Войдите с Apple для синхронизации между устройствами";
"onboarding.signin.signed_in_as" = "Вы вошли как";
"onboarding.signin.sign_in_later" = "Вы можете войти позже в Настройках";

// MARK: - Onboarding Subscription
"onboarding.subscription.title" = "Раскройте весь потенциал";
"onboarding.subscription.subtitle" = "Больше не теряйте скопированное";
"onboarding.subscription.subscribe" = "Подписаться";
"onboarding.subscription.start_free_trial" = "Продолжить с бесплатной версией";
"onboarding.subscription.free_vs_pro" = "Бесплатно: 5 элементов · Pro: Безлимитно";
"onboarding.subscription.you_are_pro" = "Вы Pro!";
"onboarding.subscription.save_44" = "ЛУЧШАЯ ЦЕНА";
"onboarding.subscription.benefit1" = "Безлимитная история буфера обмена";
"onboarding.subscription.benefit2" = "Сохраняйте текст, изображения и файлы";
"onboarding.subscription.benefit3" = "Мгновенный поиск по всем клипам";
"onboarding.subscription.benefit4" = "Приватное и безопасное локальное хранение";

// MARK: - Onboarding Complete
"onboarding.complete.title" = "Всё готово!";
"onboarding.complete.subtitle" = "ClipArc готов к использованию";
"onboarding.complete.start_using" = "Начать использовать ClipArc";
"onboarding.complete.tip.open" = "Открыть историю буфера обмена";
"onboarding.complete.tip.navigate" = "Навигация по элементам";
"onboarding.complete.tip.paste" = "Вставить выбранный элемент";
"onboarding.complete.tip.close" = "Закрыть панель";

// MARK: - Settings
"settings.title" = "Настройки";
"settings.general" = "Основные";
"settings.account" = "Учётная запись";
"settings.subscription" = "Подписка";
"settings.about" = "О программе";

"settings.history_limit" = "Лимит истории";
"settings.items" = "элементов";
"settings.startup" = "Запуск";
"settings.launch_at_login" = "Запуск при входе";
"settings.show_in_dock" = "Показывать в Dock";
"settings.hotkey" = "Горячая клавиша";
"settings.global_hotkey" = "Глобальная горячая клавиша";
"settings.permissions" = "Разрешения";
"settings.granted" = "Разрешено";
"settings.language" = "Язык";
"settings.restart_required" = "Перезапустите приложение для применения языка";
"settings.appearance" = "Оформление";
"settings.appearance.system" = "Системное";
"settings.appearance.light" = "Светлое";
"settings.appearance.dark" = "Тёмное";

"settings.sign_out" = "Выйти";
"settings.sync_description" = "Войдите для синхронизации данных между устройствами";
"settings.member_account" = "Аккаунт участника";
"settings.sign_in_description" = "Войдите для подтверждения членства";
"settings.account_linked" = "Аккаунт привязан";
"settings.benefit_membership" = "Подтвердить членство Pro";
"settings.benefit_restore" = "Легко восстановить покупки";
"settings.benefit_multi_device" = "Один аккаунт на всех устройствах";
"settings.login_required" = "Требуется вход";
"settings.login_required_message" = "Пожалуйста, сначала войдите с Apple ID для оформления подписки. Перейдите на вкладку Учётная запись.";
"settings.go_to_account" = "ОК";
"settings.accessibility_guide" = "Системные настройки → Конфиденциальность и безопасность → Универсальный доступ → Включить ClipArc";

"settings.pro_badge" = "ClipArc Pro";
"settings.lifetime_license" = "Пожизненная лицензия";
"settings.renews_on" = "Продление %@";
"settings.manage_subscription" = "Управление подпиской";
"settings.upgrade_to_pro" = "Обновить до Pro";
"settings.upgrade_description" = "Получите безлимитную историю буфера обмена и многое другое";
"settings.restore_purchases" = "Восстановить покупки";

"settings.version" = "Версия";
"settings.about_description" = "Быстрый и простой менеджер буфера обмена для macOS";
"settings.support" = "Поддержка";
"settings.privacy" = "Конфиденциальность";
"settings.terms" = "Условия";

// MARK: - Clipboard
"clipboard.empty.title" = "Пока нет клипов";
"clipboard.empty.subtitle" = "Скопируйте что-нибудь, чтобы начать";
"clipboard.search.placeholder" = "Поиск клипов...";
"clipboard.search.no_results" = "Результаты не найдены";
"clipboard.copied" = "Скопировано";
"clipboard.pasted" = "Вставлено";

"clipboard.type.all" = "Все";
"clipboard.type.frequent" = "Частые";
"clipboard.type.text" = "Текст";
"clipboard.type.image" = "Изображение";
"clipboard.type.file" = "Файл";
"clipboard.type.link" = "Ссылка";
"clipboard.delete_selected" = "Удалить выбранное";

// MARK: - Menu Bar
"menu.show_panel" = "Показать ClipArc";
"menu.preferences" = "Настройки...";
"menu.clear_history" = "Очистить историю";
"menu.about" = "О ClipArc";
"menu.help" = "Справка";
"menu.quit" = "Завершить ClipArc";

// MARK: - Rating
"rating.title" = "Нравится ClipArc?";
"rating.subtitle" = "Ваш отзыв помогает нам улучшаться";
"rating.yes_love_it" = "Да, люблю!";
"rating.not_really" = "Не очень";

// MARK: - Errors
"error.generic" = "Произошла ошибка. Пожалуйста, попробуйте снова.";
"error.auth_failed" = "Ошибка аутентификации. Пожалуйста, попробуйте снова.";
"error.purchase_failed" = "Ошибка покупки. Пожалуйста, попробуйте снова.";
"error.network" = "Ошибка сети. Пожалуйста, проверьте подключение.";

// MARK: - Time
"time.just_now" = "Только что";
"time.minutes_ago" = "%d мин назад";
"time.hours_ago" = "%d ч назад";
"time.yesterday" = "Вчера";
"time.days_ago" = "%d дн назад";

// MARK: - Toast
"toast.running" = "Работает в фоне";

"settings.storage" = "Хранилище";
"settings.cache_size" = "Размер кэша";
"settings.history_items" = "Элементов в истории";
"settings.clear_cache" = "Очистить кэш";
"settings.clear_cache_message" = "Все кэшированные изображения и миниатюры будут удалены. История буфера обмена сохранится.";
"settings.clear_all_history" = "Очистить всю историю";
"settings.clear_history_message" = "Вся история буфера обмена будет безвозвратно удалена. Это действие нельзя отменить.";
"settings.clear" = "Очистить";
